# Basic SQL Examples

In [5]:
import sqlite3
import pandas as pd

conn = sqlite3.connect("example.db")

## SELECT, FROM, WHERE, DISTINCT, ORDER BY

#### 1. Get all columns from a table

In [7]:
query = "SELECT * FROM customers"

df = pd.read_sql(query, conn)
df

   id   name  age              email        address     phone
0   1  Alice   30  alice@example.com    123 Main St  555-1234
1   2    Bob   25    bob@example.com    456 Oak Ave  555-5678
2   3   Jack   20   jack@example.com    789 Pine Rd  555-8765
3   4   Phil   45   phil@example.com   321 Maple St  555-4321
4   5   Jess   32   jess@example.com     654 Elm St  555-2468
5   6    Bob   35   bob2@example.com  987 Cedar Ave  555-1357

#### 2. Get specific columns

In [8]:
query = "SELECT name, age FROM customers"

df = pd.read_sql(query, conn)
df

    name  age
0  Alice   30
1    Bob   25
2   Jack   20
3   Phil   45
4   Jess   32
5    Bob   35

#### 3. Filter rows based on conditions

In [9]:
query = "SELECT * FROM customers WHERE age > 26 AND name != 'Bob'"

df = pd.read_sql(query, conn)
df

   id   name  age              email       address     phone
0   1  Alice   30  alice@example.com   123 Main St  555-1234
1   4   Phil   45   phil@example.com  321 Maple St  555-4321
2   5   Jess   32   jess@example.com    654 Elm St  555-2468

#### 4. Remove duplicates

In [10]:
query = "SELECT DISTINCT name FROM customers"

df = pd.read_sql(query, conn)
df

    name
0  Alice
1    Bob
2   Jack
3   Phil
4   Jess

#### 5. Sort results (ascending is default)

In [11]:
query = "SELECT name, age FROM customers ORDER BY age DESC"

df = pd.read_sql(query, conn)
df

    name  age
0   Phil   45
1    Bob   35
2   Jess   32
3  Alice   30
4    Bob   25
5   Jack   20

#### 6. Sort results (multiple columns)

In [12]:
query = "SELECT name, age, phone FROM customers ORDER BY age DESC, phone ASC"

df = pd.read_sql(query, conn)
df

    name  age     phone
0   Phil   45  555-4321
1    Bob   35  555-1357
2   Jess   32  555-2468
3  Alice   30  555-1234
4    Bob   25  555-5678
5   Jack   20  555-8765

## LIMIT / TOP, AS, and Operators

#### 1. LIMIT

In [13]:
query = "SELECT name, age FROM customers LIMIT 5"

df = pd.read_sql(query, conn)
df

    name  age
0  Alice   30
1    Bob   25
2   Jack   20
3   Phil   45
4   Jess   32